app/views/shots/index.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."shot_id" = $1  [["shot_id", 3]]
---
                  <span class="icon data"><i class="fa fa-comment"></i></span>
                  <%= shot.comments.count %>