app/views/shots/show.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."shot_id" = $1  [["shot_id", 1]]
---

          <%= pluralize(@shot.comments.count, 'Comment') %>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
           <div class="shot-full">
            <%= image_tag @shot.user_shot_url, class: 'featurette-image img-fluid mx-auto' unless @shot.user.blank? %>

SELECT "comments".* FROM "comments" WHERE "comments"."shot_id" = $1  [["shot_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."shot_id" = $1  [["shot_id", 1]]
---
       <section class="comments">
        <h2 class="subtitle is-5"><%= pluralize(@shot.comments.count, 'Comment') %></h2>