app/controllers/comments_controller.rb

SELECT  "shots".* FROM "shots" WHERE "shots"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("name", "response", "created_at", "updated_at", "shot_id", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Ah"], ["response", "Whhh"], ["created_at", "2019-01-31 19:14:12.175902"], ["updated_at", "2019-01-31 19:14:12.175902"], ["shot_id", 2], ["user_id", 1]]
---
  def create
    @shot = Shot.find(params[:shot_id]) # finds the shot with the associated shot_id
    @comment = @shot.comments.create(comment_params) # creates the comment on the shot passing in params
    @comment.user_id = current_user.id if current_user # assigns logged in user's ID to comment
    @comment.save!