app/controllers/shots_controller.rb

  def index
    @shots = Shot.all.order('created_at DESC')
---
SELECT "shots".* FROM "shots" ORDER BY created_at DESC

  def create
    @shot = current_user.shots.build(shot_params)

    respond_to do |format|
      if @shot.save
---
INSERT INTO "shots" ("title", "description", "user_id", "user_shot", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    respond_to do |format|
      if @shot.update(shot_params)
---
UPDATE "shots" SET "title" = $1, "updated_at" = $2 WHERE "shots"."id" = $3  [["title", "万里の長城"], ["updated_at", "2019-02-16 18:49:09.298298"], ["id", 5]]

    def set_shot
      @shot = Shot.find(params[:id])
---
SELECT  "shots".* FROM "shots" WHERE "shots"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]